OpenFOAM/elliot-7/Dissertation/NOTCH/GenCyclicNotch/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "variables"

convertToMeters 0.1;

vertices
(
    ($xmin $ymin $zmin) // 1
    ($h2 $ymin $zmin)
    ($h2 $ymax $zmin)
    ($xmin $ymax $zmin)
    ($xmin $ymin $h3)
    ($h2 $ymin $h3)
    ($h2 $ymax $h3)
    ($xmin $ymax $h3)
    ($xmin $ymin $cz) // 2
    ($h2 $ymin $cz)
    ($h2 $ymax $cz)
    ($xmin $ymax $cz)
    ($cx $ymin $h3) // 3
    ($cx $ymax $h3) 
    ($cx $ymin $cz)
    ($cx $ymax $cz) 
    ($xmin $ymin $lz) // 6
    ($xmin $ymax $lz)
    ($h2 $ymin $lz)
    ($h2 $ymax $lz)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($x1cells $ycells $z1cells) simpleGrading (1 1 1)
    hex (4 5 6 7 8 9 10 11) ($x1cells $ycells $z2cells) simpleGrading (1 1 1)
    hex (5 12 13 6 9 14 15 10) ($x2cells $ycells $z2cells) simpleGrading (1 1 1)
    hex (8 9 10 11 16 18 19 17) ($x2cells $ycells $z2cells) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet1
    {
        type cyclic;
	neighbourPatch outlet1;
        faces
        (
            (0 1 2 3)
        );
    }

    outlet1
    {
        type cyclic;
	neighbourPatch inlet1;
	faces
        (
            (19 18 17 16)
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
	    (2 3 7 6) // 1
	    (0 1 4 5)
	    (3 0 4 7)
	    (2 1 5 6)
	    (7 6 10 11) // 2
	    (4 5 9 8)
	    (7 4 8 11)
	    (6 13 15 10) // 3
	    (5 12 14 9) 
	    (5 6 12 13)
	    (10 15 14 9)
	    (13 12 14 15)
	    (11 10 19 17) // 4
	    (8 9 18 16)
	    (10 9 18 19)
	    (11 8 16 17)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
