OpenFOAM/elliot-7/Dissertation/NOTCH/GenCyclicNotch/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       92400;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet1;
    }
    outlet1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       92800;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet1;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6400;
        startFace       93200;
    }
)

// ************************************************************************* //
